backend/controllers/NewsController.php

SELECT * FROM `news` WHERE `id`='56'
---
    protected function findModel($id) {
        if (($model = News::findOne($id)) !== null) {