backend/controllers/PaperController.php

    public function actionIndex()
    {

        $searchModel = new PaperSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
        $model = new Paper();

        if ($model->load(Yii::$app->request->post())) {
//            $model->user_id;
            $model->modified_time = date('Y-m-d h:m:s');
            $model->user_id = \Yii::$app->user->id;
            $model->status = Paper::STATUS_BAYAR_BELUM;
            //$model->save();
            //get the instance of the uploaded file

            $imageName = Yii::$app->security->generateRandomString();
            $image = \yii\web\UploadedFile::getInstance($model, 'pre_paper');

            if ($image !== null) {
                $model->pre_paper = $image->getBaseName() .".pdf";
                $path = Yii::getAlias('../web/upload/') . $model->pre_paper;
            }
            if ($model->save()) {
---
INSERT INTO `paper` (`pre_paper`, `modified_time`, `user_id`, `status`) VALUES ('04-JadwalKuliah1415-SemGenap-Week4.pdf', '2015-04-23 03:04:37', 1, 'belum bayar')

            'totalCount' => $query -> count(),
            ]);

        $paper = $query -> orderBy('pre_paper')
                ->offset($pagination->offset)
                ->limit($pagination->limit)
                ->all();
---
SELECT * FROM `paper` ORDER BY `pre_paper` LIMIT 5

    public function actionView($id)
    {
//        return $this->render('view', [
//            'model' => $this->findModel($id),
//        ]);
        $model = new CommentPaper();
        $paper = new Paper();
        $comments = CommentPaper::find()
                ->where(['paper_id'=>$id])
                ->orderBy('id DESC')
                ->all();
---
SELECT * FROM `comment_paper` WHERE `paper_id`='16' ORDER BY `id` DESC

    protected function findModel($id)
    {
        if (($model = Paper::findOne($id)) !== null) {
---
SELECT * FROM `paper` WHERE `id`='16'