backend/controllers/SiteController.php

    public function actionIndex()
    {
        $query = News::find();
        $pagination = new Pagination(
                [
            'defaultPageSize' => 5,
            'totalCount' => $query->count(),
        ]);

//
//        $searchModel = new NewsSearch();
//        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);

        $News= News::find()->limit(5)->orderBy('date ASC')
                ->all();
---
SELECT COUNT(*) FROM `news`
SELECT * FROM `news` ORDER BY `date` LIMIT 5