frontend/controllers/PaperController.php

            'totalCount' => $query -> count(),
            ]);

        $paper = $query -> orderBy('pre_paper')
                ->offset($pagination->offset)
                ->limit($pagination->limit)
                ->all();
---
SELECT * FROM `paper` ORDER BY `pre_paper` LIMIT 5