backend/views/layouts/main.php

						<ul >
							   <?php
                                        $News = new News;
                                        $News = News::find()->limit(5)->orderBy('date ASC')
                                                ->all();
---
SELECT * FROM `news` ORDER BY `date` LIMIT 5